Public Member Functions | Friends | List of all members
ACAPI::MEP::v1::DistributionSystemsGraphTreeNode Class Referencefinal
MEP Element Manager
A structural helper class used when iterating through a DistributionSystem in the DistributionSystemsGraph as a tree. More...
#include <MEPDistributionSystemsGraphTreeNode.hpp>
 Inheritance diagram for ACAPI::MEP::v1::DistributionSystemsGraphTreeNode:
 Public Member Functions
UniqueID  | GetElement () const
std::vector< UniqueID >  | GetNextElements () const
std::optional< UniqueID >  | GetPreviousElement () const
std::optional< UniqueID >  | GetConnectedPortFromPreviousElement () const
std::optional< UniqueID >  | GetConnectedPortFromThisElement () const
std::size_t  | GetDepthFromRootNode () const
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | ACAPI::Impl::ObjectCreator
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A structural helper class used when iterating through a DistributionSystem in the DistributionSystemsGraph as a tree.
In addition to the element itself, this class also describes the parent-child relationship to other elements during traversal. Note that this parent-child relationship has no correlation to additional parameters like IFC flow direction or element creation order and the "next" and "previous" elements purely refers to the order they appear in the generated tree structure.
The tree itself is constructed from the DistributionSystemsGraph class in a depth-first search approach (DFS) starting from a specified root node.
Since
Archicad 28
Example code snippets from Test / New MEP
TraverseTree
 GSErrCode traversalError { NoError };
 ACAPI::Result<void, ACAPI::Error> result = system.TraverseTree ([&] (const ACAPI::MEP::DistributionSystemsGraphTreeNode& node) -> bool {
 const ACAPI::Result<Element> mepElement = Element::Get (node.GetElement ());
 // If the element is invalid, continue traversal.
 if (mepElement.IsErr ())
 return true;
 std::string connectedFrom;
 if (node.GetPreviousElement ().has_value ())
 connectedFrom = std::to_string (idToIndex[*node.GetPreviousElement ()]);
 else
 connectedFrom = "No connection";
 std::string connectedTo;
 if (node.GetNextElements ().size () == 0)
 connectedTo = "No connections";
 else {
 for (const auto nextElement : node.GetNextElements ()) {
 if (!connectedTo.empty ())
 connectedTo += ", ";
 connectedTo += std::to_string (idToIndex[nextElement]);
 }
 }
 API_Element textElement = {};
 textElement.header.type = API_TextID;
 API_ElementMemo textMemo;
 traversalError = ACAPI_Element_GetDefaults (&textElement, &textMemo);
 if (traversalError != NoError)
 return false;
 textElement.text.size = 0.5;
 textElement.text.loc.x = mepElement->GetAnchorPoint ().x;
 textElement.text.loc.y = mepElement->GetAnchorPoint ().y;
 textElement.text.multiStyle = false;
 textMemo.textContent = new GS::UniString { GS::UniString::SPrintf ("%llu:\nConnectedFrom: %s\nConnectedTo: %s", idToIndex[node.GetElement ()], connectedFrom.c_str (), connectedTo.c_str ()) };
 traversalError = ACAPI_Element_Create (&textElement, &textMemo);
 if (traversalError == NoError)
 traversalError = ACAPI_DisposeElemMemoHdls (&textMemo);
 // Don't continue traversal if we've encountered an error
 if (traversalError != NoError)
 return false;
 return true;
 });
Member Function Documentation
◆ GetConnectedPortFromPreviousElement()
 std::optional< UniqueID > ACAPI::MEP::v1::DistributionSystemsGraphTreeNode::GetConnectedPortFromPreviousElement  |  ( |   | ) |   const
Returns
If the current element has a parent element in the tree structure, returns the ID of the parent element's port that is connected to this element's port. Otherwise returns std::nullopt.
◆ GetConnectedPortFromThisElement()
 std::optional< UniqueID > ACAPI::MEP::v1::DistributionSystemsGraphTreeNode::GetConnectedPortFromThisElement  |  ( |   | ) |   const
Returns
If the current element has a parent element in the tree structure, returns the ID of this element's port that is connected to the parent element's port. Otherwise returns std::nullopt.
◆ GetDepthFromRootNode()
 std::size_t ACAPI::MEP::v1::DistributionSystemsGraphTreeNode::GetDepthFromRootNode  |  ( |   | ) |   const
Returns
Returns the zero-based distance from the root node in the tree structure.
◆ GetElement()
 UniqueID ACAPI::MEP::v1::DistributionSystemsGraphTreeNode::GetElement  |  ( |   | ) |   const
Returns
Returns the ID of the current element being traversed
◆ GetNextElements()
 std::vector< UniqueID > ACAPI::MEP::v1::DistributionSystemsGraphTreeNode::GetNextElements  |  ( |   | ) |   const
Returns
Returns the IDs of the next elements in the tree structure.
◆ GetPreviousElement()
 std::optional< UniqueID > ACAPI::MEP::v1::DistributionSystemsGraphTreeNode::GetPreviousElement  |  ( |   | ) |   const
Returns
If the current element has a parent element in the tree structure, returns the parent element's ID. Otherwise returns std::nullopt.